carnegiemellonracing/monorepo/DCM/Inc/stm32h7xx_hal_conf.h
// STM32F413-specific
#define  USE_HAL_JPEG_REGISTER_CALLBACKS        0U /* JPEG register callback disabled     */
#define  USE_HAL_OPAMP_REGISTER_CALLBACKS      0U /* OPAMP register callback disabled     */
#define  USE_HAL_OSPI_REGISTER_CALLBACKS        0U /* OSPI register callback disabled      */
#define  USE_HAL_OTFDEC_REGISTER_CALLBACKS      0U /* OTFDEC register callback disabled    */
#define  USE_HAL_SWPMI_REGISTER_CALLBACKS       0U /* SWPMI register callback disabled     */
#define  USE_HAL_COMP_REGISTER_CALLBACKS        0U /* COMP register callback disabled      */
#define  USE_HAL_CORDIC_REGISTER_CALLBACKS      0U /* CORDIC register callback disabled    */
#define  USE_HAL_DTS_REGISTER_CALLBACKS         0U /* DTS register callback disabled       */
#define  USE_HAL_FMAC_REGISTER_CALLBACKS        0U /* FMAC register callback disabled      */
#define  USE_HAL_GFXMMU_REGISTER_CALLBACKS      0U /* GFXMMU register callback disabled    */
#define  USE_HAL_HRTIM_REGISTER_CALLBACKS       0U /* HRTIM register callback disabled     */
#define  USE_HAL_MDIOS_REGISTER_CALLBACKS       0U /* MDIOS register callback disabled     */

/* ################## Ethernet peripheral configuration ##################### */

/* Section 1 : Ethernet peripheral configuration */

/* MAC ADDRESS: MAC_ADDR0:MAC_ADDR1:MAC_ADDR2:MAC_ADDR3:MAC_ADDR4:MAC_ADDR5 */
#define MAC_ADDR0   2U
#define MAC_ADDR1   0U
#define MAC_ADDR2   0U
#define MAC_ADDR3   0U
#define MAC_ADDR4   0U
#define MAC_ADDR5   0U

/* Definition of the Ethernet driver buffers size and count */
#define ETH_RX_BUF_SIZE                ETH_MAX_PACKET_SIZE
#define ETH_TX_BUF_SIZE                ETH_MAX_PACKET_SIZE
#define ETH_RXBUFNB                    4U
#define ETH_TXBUFNB                    4U

/* Section 2: PHY configuration section */

/* DP83848 PHY Address */
#define DP83848_PHY_ADDRESS             0x01U

/* PHY Reset delay these values are based on a 1 ms Systick interrupt */
#define PHY_RESET_DELAY                 0x000000FFU

/* PHY Configuration delay */
#define PHY_CONFIG_DELAY                0x00000FFFU

#define PHY_READ_TO                     0x0000FFFFU
#define PHY_WRITE_TO                    0x0000FFFFU

/* Section 3: Common PHY Registers */

#define PHY_BCR                         ((uint16_t)0x0000)
#define PHY_BSR                         ((uint16_t)0x0001)

#define PHY_RESET                       ((uint16_t)0x8000)
#define PHY_LOOPBACK                    ((uint16_t)0x4000)
#define PHY_FULLDUPLEX_100M             ((uint16_t)0x2100)
#define PHY_HALFDUPLEX_100M             ((uint16_t)0x2000)
#define PHY_FULLDUPLEX_10M              ((uint16_t)0x0100)
#define PHY_HALFDUPLEX_10M              ((uint16_t)0x0000)
#define PHY_AUTONEGOTIATION             ((uint16_t)0x1000)
#define PHY_RESTART_AUTONEGOTIATION     ((uint16_t)0x0200)
#define PHY_POWERDOWN                   ((uint16_t)0x0800)
#define PHY_ISOLATE                     ((uint16_t)0x0400)

#define PHY_AUTONEGO_COMPLETE           ((uint16_t)0x0020)
#define PHY_LINKED_STATUS               ((uint16_t)0x0004)
#define PHY_JABBER_DETECTION            ((uint16_t)0x0002)

/* Section 4: Extended PHY Registers */

#define PHY_SR                          ((uint16_t)0x0010)
#define PHY_MICR                        ((uint16_t)0x0011)
#define PHY_MISR                        ((uint16_t)0x0012)

#define PHY_LINK_STATUS                 ((uint16_t)0x0001)
#define PHY_SPEED_STATUS                ((uint16_t)0x0002)
#define PHY_DUPLEX_STATUS               ((uint16_t)0x0004)

#define PHY_MICR_INT_EN                 ((uint16_t)0x0002)
#define PHY_MICR_INT_OE                 ((uint16_t)0x0001)

#define PHY_MISR_LINK_INT_EN            ((uint16_t)0x0020)
#define PHY_LINK_INTERRUPT              ((uint16_t)0x2000)

/* ########################## Assert Selection ############################## */
/**
  * @brief Uncomment the line below to expanse the "assert_param" macro in the
  *        HAL drivers code
  */
/* #define USE_FULL_ASSERT    1 */


/* Includes ------------------------------------------------------------------*/
/**
  * @brief Include module's header file
  */

#ifdef HAL_RCC_MODULE_ENABLED
  #include "stm32h7xx_hal_rcc.h"
#endif /* HAL_RCC_MODULE_ENABLED */

#ifdef HAL_GPIO_MODULE_ENABLED
  #include "stm32h7xx_hal_gpio.h"
#endif /* HAL_GPIO_MODULE_ENABLED */

#ifdef HAL_DMA_MODULE_ENABLED
  #include "stm32h7xx_hal_dma.h"
#endif /* HAL_DMA_MODULE_ENABLED */

#ifdef HAL_MDMA_MODULE_ENABLED
 #include "stm32h7xx_hal_mdma.h"
#endif /* HAL_MDMA_MODULE_ENABLED */

#ifdef HAL_HASH_MODULE_ENABLED
  #include "stm32h7xx_hal_hash.h"
#endif /* HAL_HASH_MODULE_ENABLED */

#ifdef HAL_DCMI_MODULE_ENABLED
  #include "stm32h7xx_hal_dcmi.h"
#endif /* HAL_DCMI_MODULE_ENABLED */

#ifdef HAL_DMA2D_MODULE_ENABLED
  #include "stm32h7xx_hal_dma2d.h"
#endif /* HAL_DMA2D_MODULE_ENABLED */

#ifdef HAL_DSI_MODULE_ENABLED
  #include "stm32h7xx_hal_dsi.h"
#endif /* HAL_DSI_MODULE_ENABLED */

#ifdef HAL_DFSDM_MODULE_ENABLED
  #include "stm32h7xx_hal_dfsdm.h"
#endif /* HAL_DFSDM_MODULE_ENABLED */

#ifdef HAL_DTS_MODULE_ENABLED
 #include "stm32h7xx_hal_dts.h"
#endif /* HAL_DTS_MODULE_ENABLED */

#ifdef HAL_ETH_MODULE_ENABLED
  #include "stm32h7xx_hal_eth.h"
#endif /* HAL_ETH_MODULE_ENABLED */

#ifdef HAL_EXTI_MODULE_ENABLED
  #include "stm32h7xx_hal_exti.h"
#endif /* HAL_EXTI_MODULE_ENABLED */

#ifdef HAL_CORTEX_MODULE_ENABLED
  #include "stm32h7xx_hal_cortex.h"
#endif /* HAL_CORTEX_MODULE_ENABLED */

#ifdef HAL_ADC_MODULE_ENABLED
  #include "stm32h7xx_hal_adc.h"
#endif /* HAL_ADC_MODULE_ENABLED */

#ifdef HAL_FDCAN_MODULE_ENABLED
  #include "stm32h7xx_hal_fdcan.h"
#endif /* HAL_FDCAN_MODULE_ENABLED */

#ifdef HAL_CEC_MODULE_ENABLED
  #include "stm32h7xx_hal_cec.h"
#endif /* HAL_CEC_MODULE_ENABLED */

#ifdef HAL_COMP_MODULE_ENABLED
  #include "stm32h7xx_hal_comp.h"
#endif /* HAL_COMP_MODULE_ENABLED */

#ifdef HAL_CORDIC_MODULE_ENABLED
  #include "stm32h7xx_hal_cordic.h"
#endif /* HAL_CORDIC_MODULE_ENABLED */

#ifdef HAL_CRC_MODULE_ENABLED
  #include "stm32h7xx_hal_crc.h"
#endif /* HAL_CRC_MODULE_ENABLED */

#ifdef HAL_CRYP_MODULE_ENABLED
  #include "stm32h7xx_hal_cryp.h"
#endif /* HAL_CRYP_MODULE_ENABLED */

#ifdef HAL_DAC_MODULE_ENABLED
  #include "stm32h7xx_hal_dac.h"
#endif /* HAL_DAC_MODULE_ENABLED */

#ifdef HAL_FLASH_MODULE_ENABLED
  #include "stm32h7xx_hal_flash.h"
#endif /* HAL_FLASH_MODULE_ENABLED */

#ifdef HAL_GFXMMU_MODULE_ENABLED
  #include "stm32h7xx_hal_gfxmmu.h"
#endif /* HAL_GFXMMU_MODULE_ENABLED */

#ifdef HAL_FMAC_MODULE_ENABLED
  #include "stm32h7xx_hal_fmac.h"
#endif /* HAL_FMAC_MODULE_ENABLED */

#ifdef HAL_HRTIM_MODULE_ENABLED
  #include "stm32h7xx_hal_hrtim.h"
#endif /* HAL_HRTIM_MODULE_ENABLED */

